<template>
  <header class="header">
    <div class="_container">
      <div class="header__wrap">
        <div class="header__burger" :class="{_active: active}" @click="active = !active"></div>
        <div class="header__logo">
          <img src="../assets/img/logo.svg" alt="">
        </div>

        <div class="header__catalog">
          <img src="../assets/img/icons/icons.svg#menu" alt="">
          <span>Каталог</span>
        </div>
        <div class="header__search">
          <form>
            <div class="header__search-group">
              <autocomplete-vue
                  :list="items"
                  placeholder="Хочу найти..."
              ></autocomplete-vue>
            </div>
            <button type="submit">
              <img src="../assets/img/icons/icons.svg#search" alt="">
            </button>
          </form>
        </div>
        <div class="header__list">
          <img src="../assets/img/icons/icons.svg#list" alt="">
          <span>Список</span>
        </div>

        <div class="header__profile">
          <img src="../assets/img/user.svg" alt="">
        </div>

      </div>
    </div>
    <div class="header__mobile" :class="{_active: active}">
      <div class="header__catalog">
        <img src="../assets/img/icons/icons.svg#menu" alt="">
        <span>Каталог</span>
      </div>
      <div class="header__list">
        <img src="../assets/img/icons/icons.svg#list" alt="">
        <span>Список</span>
      </div>
      <div class="header__search">
        <form>
          <div class="header__search-group">
            <autocomplete-vue
                :list="items"
                placeholder="Хочу найти..."
            ></autocomplete-vue>
          </div>
          <button type="submit">
            <img src="../assets/img/icons/icons.svg#search" alt="">
          </button>
        </form>
      </div>
    </div>
  </header>
</template>

<script>
export default {
  name: 'Header',
  data(){
    return {
      active: false,
      items: [
        {name:'Гидроизоляционные составы'},
        {name:'Наливные полы'},
        {name:'стяжки'},
        {name:'Сухие смеси'},
        {name:'Шпаклевки'},
        {name:'Штукатурки'},
        {name:'Утеплители'},
        {name:'Базальтовая теплоизоляция'},
        {name:'Вспененный полиэтилен'},
        {name:'Гидро- и теплоизоляционные панели'},
        {name:'Жидкая теплоизоляция'},
        {name:'Минеральные плиты'},
        {name:'Пенопласт'},
        {name:'Стекловата - стекловолокно'},
        {name:'Экструдированный'},
        {name:'пенополистирол'},
        {name:'Изоляционные материалы'},
        {name:'Изоляционные материалы'},
        {name:'Мягкая ДВП'},
        {name:'Паро- гидроизоляция'},
        {name:'Пробковые изоляционные материалы'},
        {name:'Кровельные материалы'},
        {name:'Мягкая кровля'},
        {name:'Профнастил'},
        {name:'Рулонные кровельные и подкровельные материалы'},
        {name:'Лакокрасочные материалы'},
        {name:'Водно-дисперсионная краска'},
        {name:'Готовые грунтовки'},
        {name:'Декоративные покрытия'},
        {name:'Краски специального назначения'},
        {name:'Лаки'},
        {name:'Лакокрасочные материалы'},
        {name:'Олифа'},
        {name:'Покрытие для камня, кирпича, бетона'},
        {name:'Средства для защиты древесины'},
        {name:'Эмали'},
        {name:'Строительная Химия'},
        {name:'Герметики'},
        {name:'Гидроизоляция строительных конструкций'},
        {name:'Добавки'},
        {name:'Жидкие Гвозди'},
        {name:'Монтажная Пена'},
        {name:'Очистители'},
        {name:'Средства для ухода за напольными покрытиям'},
        {name:'Керамогранит, керамическая и стеклянная плитка'},
        {name:'Агломерато-гранит'},
        {name:'Керамическая плитка'},
        {name:'Керамогранит'},
        {name:'Мраморная плитка с фарфоровым укрепляющим слоем'},
        {name:'Стеклянная плитка'},
        {name:'Клеевые материалы'},
        {name:'Клеи для линолеума и ковролина'},
        {name:'Клей для гипсокартона и гипсовых плит'},
        {name:'Клей для камня и блоков'},
        {name:'Клей для обоев'},
        {name:'Клей для паркета'},
        {name:'Клей для плитки и керамогранита'},
        {name:'Клея специального назначения'},
        {name:'Материалы для дизайна'},
        {name:'Декоративные балки из полиуретана'},
        {name:'Настенные покрытия из бамбука, камыша, тростника'},
        {name:'Облицовочный камень'},
        {name:'Панели декоракрил'},
        {name:'Пожаробезопасные стеновые панели'},
        {name:'Пробковые настенные покрытия'},
        {name:'Напольные покрытия'},
        {name:'Аксессуары для укладки напольных покрытий'},
        {name:'Грязезащитные ковровые покрытия'},
        {name:'Декоративная виниловая плитка'},
        {name:'Ковровые покрытия (ковролин)'},
        {name:'Ламинат'},
        {name:'Линолеум'},
        {name:'Напольные покрытия для бассейнов, саун, бань'},
        {name:'Паркет'},
        {name:'Пробковые полы'},
        {name:'Синтетическая напольная плитка'},
        {name:'Настенные обои'},
        {name:'Обои'},
        {name:'Бумажные обои'},
        {name:'Виниловые обои на флизелиновой основе под покраску'},
        {name:'Малярный стеклохолст'},
        {name:'Натуральные обои'},
        {name:'Пробковые обои'},
        {name:'Самоклеющиеся пробковые обои'},
        {name:'Стеклотканевые обои'},
        {name:'Плинтуса, пороги, планки'},
        {name:'Плинтуса'},
        {name:'Противоскользящие накладки и ленты'},
        {name:'Противоскользящие пороги'},
        {name:'Профили для плитки и керамогранита'},
        {name:'Потолочные покрытия'},
        {name:'Натяжные потолки'},
        {name:'Плиты из натуральных материалов'},
        {name:'Подвесные потолки'},
        {name:'Потолки реечные'},
        {name:'Водосточные системы'},
        {name:'Сайдинг и водосточные системы'},
        {name:'Сайдинг - пожаробезопасные фасадные панели'},
        {name:'Сайдинг виниловый и аксессуары'},
        {name:'Стационарные и чердачные лестницы'},
        {name:'Ножничные лестницы'},
        {name:'Складные чердачные лестницы'},
        {name:'Стальные винтовые и маршевые лестницы'},
        {name:'Стационарные лестницы'},
        {name:'Стеновые покрытия'},
        {name:'Листовые МДФ панели'},
        {name:'Листы перфорированные'},
        {name:'Панели наборные ПВХ'},
        {name:'Пожаробезопасные стеновые панели'},
        {name:'Стеновые панели МДФ'},
        {name:'Фанера'},
        {name:'Гипсокартон'},
        {name:'ДВП'},
        {name:'МДФ'},
        {name:'OSB'},
        {name:'ЛДСП'},
        {name:'СМЛ'},
        {name:'Гипсокартон'},
        {name:'Древесноволокнистая плита (ДВП оргалит)'},
        {name:'Ламинированная древесностружечная плита (ЛДСП)'},
        {name:'МДФ'},
        {name:'Ориентированно-стружечная плита (OSB)'},
        {name:'Профили'},
        {name:'Стекломагниевый лист (СМЛ)'},
        {name:'Фанера'},
        {name:'Двери'},
        {name:'Двери для саун'},
        {name:'Межкомнатные двери'},
        {name:'Раздвижные двери'},
        {name:'Внешняя отделка'},
        {name:'Глина'},
        {name:'Деревянные балки'},
        {name:'Арматура'},
        {name:'Балки'},
        {name:'Геодезия в строительстве'},
        {name:'Песок строительный'},
        {name:'Щебень'},
        {name:'ФБС блоки'},
        {name:'Камень Бут'},
        {name:'Сваи'},
        {name:'Черновой пол'},
        {name:'Бетон'},
        {name:'Опалубка'},
        {name:'Чистовой пол'},
        {name:'Гипсоволокнистые листы (ГВЛ)'},
        {name:'Кирпич облицовочный'},
        {name:'Блок керамический или керамоблок'},
        {name:'Монолитный пенобетон'},
        {name:'Двойной рабочий кирпич'},
        {name:'Плиты перекрытия'},
        {name:'Сайдинг'},
        {name:'Цемент'},
        {name:'Пеноблок - пенобетон'},
        {name:'Крепежи'},
        {name:'Гидроизоляция'},
        {name:'СМЛ - стекло-магнезитовый лист'},
        {name:'Мягкая кровля'},
        {name:'Ондулин'},
        {name:'Черепица'},
        {name:'Штукатурка'},
        {name:'Окна'},
        {name:'Двери'},
      ]
    }
  }
}
</script>

